
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>抽象工厂模式 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="建造者模式.html" />
    
    
    <link rel="prev" href="工厂模式.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    项目介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    设计模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="创建对象的安全模式.html">
            
                <a href="创建对象的安全模式.html">
            
                    
                    创建对象的安全模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="简单工厂模式.html">
            
                <a href="简单工厂模式.html">
            
                    
                    简单工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="工厂模式.html">
            
                <a href="工厂模式.html">
            
                    
                    工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="抽象工厂模式.html">
            
                <a href="抽象工厂模式.html">
            
                    
                    抽象工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="建造者模式.html">
            
                <a href="建造者模式.html">
            
                    
                    建造者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="原型模式.html">
            
                <a href="原型模式.html">
            
                    
                    原型模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="单例模式.html">
            
                <a href="单例模式.html">
            
                    
                    单例模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../interview/">
            
                <a href="../interview/">
            
                    
                    面试相关
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../interview/设计模式面试题-1.html">
            
                <a href="../interview/设计模式面试题-1.html">
            
                    
                    设计模式面试题-1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../interview/设计模式面试题-2.html">
            
                <a href="../interview/设计模式面试题-2.html">
            
                    
                    设计模式面试题-2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../JavaScript/">
            
                <a href="../JavaScript/">
            
                    
                    JavaScript
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../JavaScript/1.高阶函数.html">
            
                <a href="../JavaScript/1.高阶函数.html">
            
                    
                    高阶函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../JavaScript/2.ES5重写startsWith和endsWith.html">
            
                <a href="../JavaScript/2.ES5重写startsWith和endsWith.html">
            
                    
                    ES5 重写 startsWith 和 endsWith
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../JavaScript/3.继承.html">
            
                <a href="../JavaScript/3.继承.html">
            
                    
                    继承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../JavaScript/4.toString.html">
            
                <a href="../JavaScript/4.toString.html">
            
                    
                    toString
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="../JavaScript/JavaScript高级程序设计.html">
            
                <a href="../JavaScript/JavaScript高级程序设计.html">
            
                    
                    JavaScript 高程三笔记
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Linux/">
            
                <a href="../Linux/">
            
                    
                    Linux 相关
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Linux/1.Linux常见命令.html">
            
                <a href="../Linux/1.Linux常见命令.html">
            
                    
                    Linux 常见命令
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >抽象工厂模式</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <blockquote>
<p>&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#xFF1A;&#x201C;Define an interface for creating an object, but let subclasses decide which class to instantiate. Factory Method lets a class defer instantiation to subclasses.&#x201D;(&#x5728;&#x57FA;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x8BA9;&#x5B50;&#x7C7B;&#x51B3;&#x5B9A;&#x5B9E;&#x4F8B;&#x5316;&#x54EA;&#x4E2A;&#x7C7B;&#x3002;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x8BA9;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x5EF6;&#x8FDF;&#x5230;&#x5B50;&#x7C7B;&#x4E2D;&#x8FDB;&#x884C;&#x3002;)</p>
</blockquote>
<p>&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x8FD9;&#x5757;&#x77E5;&#x8BC6;&#xFF0C;&#x5BF9;&#x5165;&#x884C;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x5199;&#x7EAF; JavaScript &#x7684;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x53CB;&#x597D;&#x2014;&#x2014;&#x56E0;&#x4E3A;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x90FD;&#x88AB;&#x8BA4;&#x4E3A;&#x662F; Java/C++ &#x8FD9;&#x7C7B;&#x8BED;&#x8A00;&#x7684;&#x4E13;&#x5229;&#x3002;</p>
<p>Java/C++ &#x7684;&#x7279;&#x6027;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x4EEC;&#x662F;&#x5F3A;&#x7C7B;&#x578B;&#x7684;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x3002;&#x7528;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x65F6;&#x523B;&#x5173;&#x6CE8;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BE5;&#x5BF9;&#x8C61;&#x65E5;&#x540E;&#x53EF;&#x4EE5;&#x8868;&#x73B0;&#x51FA;&#x591A;&#x6001;&#x6027;&#x3002;&#x4F46; JavaScript&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5F31;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x5929;&#x7136;&#x7684;&#x591A;&#x6001;&#x6027;&#xFF0C;&#x597D;&#x50CF;&#x538B;&#x6839;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x7C7B;&#x578B;&#x8026;&#x5408;&#x95EE;&#x9898;&#x3002;&#x800C;&#x76EE;&#x524D;&#x7684; JavaScript &#x8BED;&#x6CD5;&#x91CC;&#xFF0C;&#x4E5F;&#x786E;&#x5B9E;&#x4E0D;&#x652F;&#x6301;&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x76F4;&#x63A5;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x51ED;&#x501F;&#x6A21;&#x62DF;&#x53BB;&#x8FD8;&#x539F;&#x62BD;&#x8C61;&#x7C7B;&#x3002;&#x56E0;&#x6B64;&#x6709;&#x4E00;&#x79CD;&#x8A00;&#x8BBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x5BF9;&#x4E8E;&#x524D;&#x7AEF;&#x6765;&#x8BF4;&#xFF0C;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x5C31;&#x662F;&#x9E21;&#x808B;&#x3002;</p>
<p>&#x4F46;&#x73B0;&#x5728;&#xFF0C;&#x4E0D;&#x8981;&#x770B;&#x5230;&#x201C;&#x62BD;&#x8C61;&#x201D;&#x4E24;&#x4E2A;&#x5B57;&#x8F6C;&#x8EAB;&#x5C31;&#x8D70;&#xFF0C;&#x9E21;&#x808B;&#x4E0D;&#x9E21;&#x808B;&#x7406;&#x89E3;&#x6E05;&#x695A;&#x4E86;&#x624D;&#x6709;&#x53D1;&#x8A00;&#x6743;&#x3002;</p>
<h3 id="&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6848;&#x4F8B;&#x540E;&#x7EED;">&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x6848;&#x4F8B;&#x540E;&#x7EED;</h3>
<p>&#x5728;&#x5B9E;&#x9645;&#x7684;&#x4E1A;&#x52A1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x9762;&#x5BF9;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5E76;&#x975E;&#x6570;&#x4E2A;&#x7C7B;&#x3001;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x52A8;&#x7528;&#x591A;&#x4E2A;&#x5DE5;&#x5382;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x770B;<a href="https://segmentfault.com/a/1190000022088395" target="_blank">&#x4E0A;&#x4E2A;&#x5C0F;&#x8282;</a>&#x4E3E;&#x51FA;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x51FD;&#x6570;&#x6700;&#x540E;&#x957F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Factory</span>(<span class="hljs-params">name, age, career</span>) </span>{
    <span class="hljs-keyword">var</span> work;
    <span class="hljs-keyword">switch</span>(career) {
        <span class="hljs-keyword">case</span> <span class="hljs-string">&apos;employees&apos;</span>:
            work = [<span class="hljs-string">&quot;&#x529E;&#x5B58;&#x6B3E;&quot;</span>, <span class="hljs-string">&quot;&#x653E;&#x8D37;&#x6B3E;&quot;</span>, <span class="hljs-string">&quot;&#x6536;&#x8D37;&#x6B3E;&quot;</span>];
        <span class="hljs-keyword">case</span> <span class="hljs-string">&apos;president&apos;</span>:
            work = [<span class="hljs-string">&quot;&#x559D;&#x8336;&quot;</span>, <span class="hljs-string">&quot;&#x770B;&#x62A5;&#x7EB8;&quot;</span>, <span class="hljs-string">&quot;...&quot;</span>];
        <span class="hljs-keyword">case</span> <span class="hljs-string">&apos;chairman&apos;</span>:
            work = [<span class="hljs-string">&quot;&#x559D;&#x6C34;&quot;</span>, <span class="hljs-string">&quot;&#x653E;&#x8D37;&#x7B7E;&#x5B57;&quot;</span>, <span class="hljs-string">&quot;&#x5F00;&#x4F1A;&quot;</span>];
        <span class="hljs-keyword">case</span> xxx:
            <span class="hljs-comment">// &#x5DE5;&#x79CD;&#x5BF9;&#x5E94;&#x804C;&#x8D23;</span>
        ...
    }
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> User(name, age, career, work);
}
</code></pre>
<p>&#x4E4D;&#x770B;&#x4E4B;&#x4E0B;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4ED4;&#x7EC6;&#x770B;&#x4E0A;&#x53BB;&#x9996;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x628A;&#x884C;&#x957F;&#x548C;&#x666E;&#x901A;&#x804C;&#x5DE5;&#x653E;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#x3002;&#x884C;&#x957F;&#x548C;&#x804C;&#x5DE5;&#x5728;&#x804C;&#x80FD;&#x4E0A;&#x7684;&#x5DEE;&#x522B;&#x8FD8;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x6743;&#x9650;&#x4E0D;&#x540C;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x4E0D;&#x540C;&#xFF1B;&#x518D;&#x8005;&#xFF0C;......</p>
<p>&#x90A3;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x8981;&#x5728;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x91CC;&#x52A0;&#x5165;&#x76F8;&#x5173;&#x7684;&#x903B;&#x8F91;&#x5224;&#x65AD;&#x5417;&#xFF1F;&#x5355;&#x4ECE;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x4E0A;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x4E48;&#x505A;&#x5B9E;&#x5219;&#x5728;&#x6316;&#x5751;&#xFF0C;&#x56E0;&#x4E3A;&#x94F6;&#x884C;&#x7684;&#x5DE5;&#x79CD;&#x591A;&#x7740;&#x5462;&#xFF0C;&#x4E0D;&#x6B62;&#x6709;&#x884C;&#x957F;&#x3001;&#x666E;&#x901A;&#x804C;&#x5DE5;&#x3001;&#x8FD8;&#x6709;&#x4E3B;&#x4EFB;&#x3001;&#x652F;&#x884C;&#x957F;&#x3001;&#x5206;&#x884C;&#x957F;&#x7B49;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x6743;&#x9650;&#x3001;&#x804C;&#x80FD;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x5982;&#x679C;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#xFF0C;&#x6BCF;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x5DE5;&#x79CD;&#x5C31;&#x5728; Factory &#x589E;&#x52A0;&#x76F8;&#x5E94;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x90A3;&#x9996;&#x5148;&#x4F1A;&#x9020;&#x6210;&#x8FD9;&#x4E2A;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x5F02;&#x5E38;&#x5E9E;&#x5927;&#xFF0C;&#x5927;&#x5230;&#x6700;&#x7EC8;&#x4F60;&#x4E0D;&#x6562;&#x589E;&#x52A0;/&#x4FEE;&#x6539;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#xFF0C;&#x751F;&#x6015;&#x5BFC;&#x81F4; Factory &#x51FA;&#x73B0; bug &#x5F71;&#x54CD;&#x73B0;&#x6709;&#x7CFB;&#x7EDF;&#x903B;&#x8F91;&#xFF0C;&#x4E5F;&#x4F7F;&#x5F97;&#x5176;&#x96BE;&#x4EE5;&#x7EF4;&#x62A4;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x6BCF;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x5DE5;&#x79CD;&#x7684;&#x903B;&#x8F91;&#x5C31;&#x9700;&#x8981;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x5BF9; Factory &#x65B9;&#x6CD5;&#x6574;&#x4E2A;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x56DE;&#x5F52;&#xFF0C;&#x7ED9;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;<strong>&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x7684;&#x6E90;&#x5934;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x9075;&#x5B88;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x5F00;&#x653E;&#x5C01;&#x95ED;&#x539F;&#x5219;</strong>&#x3002;&#x6211;&#x4EEC;&#x518D;&#x590D;&#x4E60;&#x4E00;&#x4E0B;&#x5F00;&#x653E;&#x5C01;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5185;&#x5BB9;&#xFF1A;&#x5BF9;&#x62D3;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5C01;&#x95ED;&#x3002;&#x8BF4;&#x5F97;&#x66F4;&#x51C6;&#x786E;&#x70B9;&#xFF0C;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#xFF08;&#x7C7B;&#x3001;&#x6A21;&#x5757;&#x3001;&#x51FD;&#x6570;&#xFF09;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x53EF;&#x4FEE;&#x6539;&#x3002;</p>
<h3 id="&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;">&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</h3>
<p>&#x6211;&#x4EEC;&#x5148;&#x4E0D;&#x6025;&#x4E8E;&#x7406;&#x89E3;&#x5177;&#x4F53;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5148;&#x6765;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>&#x6709;&#x4E00;&#x5929;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x94F6;&#x884C;&#xFF0C;&#x7ED9;&#x5927;&#x5802;&#x7ECF;&#x7406;&#x8BF4;&#x6211;&#x8981;&#x529E;&#x4E00;&#x5F20;&#x501F;&#x8BB0;&#x5361;&#x3001;&#x4E00;&#x5F20;&#x4FE1;&#x7528;&#x5361;&#x3002;&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x5361;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x90FD;&#x53EF;&#x4EE5;&#x5B58;&#x94B1;&#xFF08;&#x867D;&#x7136;&#x4FE1;&#x7528;&#x5361;&#x5B58;&#x94B1;&#x6CA1;&#x6709;&#x5229;&#x606F;&#xFF09;&#x3001;&#x8F6C;&#x8D26;&#xFF08;&#x5047;&#x88C5;&#x4FE1;&#x7528;&#x5361;&#x53EF;&#x4EE5;&#x8F6C;&#x8D26;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x94F6;&#x884C;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x519C;&#x884C;&#x53EF;&#x4EE5;&#x529E;&#x5361;&#xFF0C;&#x5DE5;&#x884C;&#x4E5F;&#x53EF;&#x4EE5;&#x529E;&#x5361;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x5BB6;&#x94F6;&#x884C;&#x4E5F;&#x5177;&#x5907;&#x540C;&#x6837;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x53C8;&#x6709;&#x4E00;&#x5929;&#x6211;&#x4EEC;&#x60F3;&#x7EC4;&#x88C5;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E3B;&#x673A;&#x7531;&#x5185;&#x5B58;&#x6761;&#x3001;&#x786C;&#x76D8;&#x3001;CPU&#x3001;&#x7535;&#x6E90;&#x3001;&#x663E;&#x5361;&#x7B49;&#x7EC4;&#x6210;&#xFF0C;&#x800C;&#x5185;&#x5B58;&#x6761;&#x3001;&#x786C;&#x76D8;&#x7B49;&#x90E8;&#x4EF6;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#x5382;&#x5BB6;&#x751F;&#x4EA7;&#xFF0C;&#x4E00;&#x65F6;&#x4E4B;&#x95F4;&#x6211;&#x4EEC;&#x5B9A;&#x4E0D;&#x597D;&#x60F3;&#x7EC4;&#x88C5;&#x4E00;&#x53F0;&#x4EC0;&#x4E48;&#x914D;&#x7F6E;&#x7684;&#x4E3B;&#x673A;&#x3002;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5148;&#x7EA6;&#x5B9A;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x4E3B;&#x673A;&#x7C7B;&#xFF0C;&#x8BA9;&#x5B83;&#x5177;&#x6709;&#x5404;&#x79CD;&#x786C;&#x4EF6;&#x5C5E;&#x6027;&#xFF0C;&#x63A5;&#x7740;&#x5728;&#x5BF9;&#x5404;&#x786C;&#x4EF6;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x62E5;&#x6709;&#x4E86;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7C7B;&#x548C;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x7C7B;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x573A;&#x666F;&#x662F;&#x5C5E;&#x4E8E;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5361;&#x7C7B;&#x5C5E;&#x4E8E;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x7C7B;&#xFF0C;&#x5236;&#x5B9A;&#x4EA7;&#x54C1;&#x5361;&#x7C7B;&#x6240;&#x5177;&#x5907;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x800C;&#x94F6;&#x884C;&#x548C;&#x4E4B;&#x524D;&#x7684;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E00;&#x6837;&#xFF0C;&#x8D1F;&#x8D23;&#x751F;&#x4EA7;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x5B9E;&#x4F8B;&#xFF0C;&#x901A;&#x8FC7;&#x5927;&#x5802;&#x7ECF;&#x7406;&#x5C31;&#x53EF;&#x4EE5;&#x62FF;&#x5230;&#x5361;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x94F6;&#x884C;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x62BD;&#x8C61;&#x4E3A;&#x94F6;&#x884C;&#x7C7B;&#xFF0C;&#x7EE7;&#x627F;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x94F6;&#x884C;&#x5B9E;&#x4F8B;&#x90FD;&#x6709;&#x529E;&#x5361;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x62BD;&#x8C61;&#x7C7B;&#x5BF9;&#x5B9E;&#x4F8B;&#x7684;&#x7EA6;&#x675F;&#x3002;</p>
<h3 id="&#x793A;&#x4F8B;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;">&#x793A;&#x4F8B;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;</h3>
<pre><code class="lang-javascript"><span class="hljs-comment">// &#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7C7B;</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">BankFactory</span> </span>{
  <span class="hljs-keyword">constructor</span>() {
    <span class="hljs-keyword">if</span> (<span class="hljs-keyword">new</span>.target === BankFactory) {
      <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7C7B;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5B9E;&#x4F8B;&#x5316;!&quot;</span>);
    }
  }
  <span class="hljs-comment">// &#x62BD;&#x8C61;&#x65B9;&#x6CD5;-&#x529E;&#x5361;</span>
  createBankCard() {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7C7B;&#x4E0D;&#x5141;&#x8BB8;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#xFF0C;&#x8BF7;&#x91CD;&#x5199;&#x5B9E;&#x73B0;!&quot;</span>);
  }
  <span class="hljs-comment">// &#x62BD;&#x8C61;&#x65B9;&#x6CD5;-&#x5B58;&#x94B1;</span>
  saveMoney() {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x7C7B;&#x4E0D;&#x5141;&#x8BB8;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#xFF0C;&#x8BF7;&#x91CD;&#x5199;&#x5B9E;&#x73B0;!&quot;</span>);
  }
}
<span class="hljs-comment">// &#x5177;&#x4F53;&#x94F6;&#x884C;&#x7C7B;</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Icbc</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">BankFactory</span> </span>{
  createBankCard(type) {
    <span class="hljs-keyword">switch</span> (type) {
      <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;debit&quot;</span>:
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> DebitCard();
      <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;credit&quot;</span>:
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> CreditCard();
      <span class="hljs-keyword">default</span>:
        <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;!&quot;</span>);
    }
  }
}
<span class="hljs-comment">// &#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x7C7B;</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Card</span> </span>{
  <span class="hljs-comment">// &#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x65B9;&#x6CD5;</span>
  buy() {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x65B9;&#x6CD5;&#x4E0D;&#x5141;&#x8BB8;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#xFF0C;&#x8BF7;&#x91CD;&#x65B0;&#x5B9E;&#x73B0;&#xFF01;&quot;</span>);
  }
  transfer() {
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x65B9;&#x6CD5;&#x4E0D;&#x5141;&#x8BB8;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#xFF0C;&#x8BF7;&#x91CD;&#x65B0;&#x5B9E;&#x73B0;&#xFF01;&quot;</span>);
  }
}
<span class="hljs-comment">// &#x5177;&#x4F53;&#x501F;&#x8BB0;&#x5361;&#x7C7B;</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">DebitCard</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Card</span> </span>{
  buy() {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DE5;&#x884C;&#x501F;&#x8BB0;&#x5361;&#x8FDB;&#x884C;&#x6D88;&#x8D39;&#x4E86;&#xFF01;&quot;</span>);
  }
  transfer() {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DE5;&#x884C;&#x501F;&#x8BB0;&#x5361;&#x8FDB;&#x884C;&#x8F6C;&#x8D26;&#x4E86;&#xFF01;&quot;</span>);
  }
}
<span class="hljs-comment">// &#x5177;&#x4F53;&#x4FE1;&#x7528;&#x5361;&#x7C7B;</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">CreditCard</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Card</span> </span>{
  buy() {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DE5;&#x884C;&#x4FE1;&#x7528;&#x5361;&#x8FDB;&#x884C;&#x6D88;&#x8D39;&#x4E86;&#xFF01;&quot;</span>);
  }
  transfer() {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5DE5;&#x884C;&#x4FE1;&#x7528;&#x5361;&#x8FDB;&#x884C;&#x8F6C;&#x8D26;&#x4E86;&#xFF01;&quot;</span>);
  }
}
<span class="hljs-keyword">const</span> myBank = <span class="hljs-keyword">new</span> Icbc();
<span class="hljs-keyword">const</span> myCard = myBank.createBankCard(<span class="hljs-string">&quot;debit&quot;</span>);
myCard.buy();
</code></pre>
<h3 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h3>
<p>&#x5927;&#x5BB6;&#x73B0;&#x5728;&#x56DE;&#x5934;&#x5BF9;&#x6BD4;&#x4E00;&#x4E0B;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x548C;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF1A;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6709;&#x54EA;&#x4E9B;&#x5F02;&#x540C;&#xFF1F;</p>
<p>&#x5B83;&#x4EEC;&#x7684;&#x5171;&#x540C;&#x70B9;&#xFF0C;&#x5728;&#x4E8E;&#x90FD;&#x5C1D;&#x8BD5;&#x53BB;&#x5206;&#x79BB;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x53D8;&#x4E0E;&#x4E0D;&#x53D8;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x4E0D;&#x540C;&#x5728;&#x4E8E;&#x573A;&#x666F;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;
&#x5728;&#x7B80;&#x5355;&#x5DE5;&#x5382;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x91CC;&#xFF0C;&#x5904;&#x7406;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x4E00;&#x4E9B;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x7684;&#x7C7B;&#x2014;&#x2014;&#x5B83;&#x4EEC;&#x7684;&#x5171;&#x6027;&#x5BB9;&#x6613;&#x62BD;&#x79BB;&#xFF0C;&#x540C;&#x65F6;&#x56E0;&#x4E3A;&#x903B;&#x8F91;&#x672C;&#x8EAB;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x800C;&#x4E0D;&#x671F;&#x8BB8;&#x4EE3;&#x7801;&#x5F88;&#x9AD8;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;
&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x672C;&#x8D28;&#x4E0A;&#x5904;&#x7406;&#x7684;&#x4E5F;&#x662F;&#x7C7B;&#xFF0C;&#x4F46;&#x662F;&#x662F;&#x76F8;&#x5BF9;&#x66F4;&#x52A0;&#x7E41;&#x6742;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x4E2D;&#x4E0D;&#x4EC5;&#x80FD;&#x5212;&#x5206;&#x51FA;&#x95E8;&#x6D3E;&#xFF0C;&#x8FD8;&#x80FD;&#x5212;&#x5206;&#x51FA;&#x7B49;&#x7EA7;&#xFF0C;&#x540C;&#x65F6;&#x5B58;&#x5728;&#x7740;&#x5F88;&#x9AD8;&#x7684;&#x6269;&#x5C55;&#x53EF;&#x80FD;&#x6027;&#x2014;&#x2014;&#x8FD9;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5BF9;&#x5171;&#x6027;&#x4F5C;&#x66F4;&#x7279;&#x522B;&#x7684;&#x5904;&#x7406;&#x3001;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x7C7B;&#x53BB;&#x964D;&#x4F4E;&#x6269;&#x5C55;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x540C;&#x65F6;&#x9700;&#x8981;&#x5BF9;&#x7C7B;&#x7684;&#x6027;&#x8D28;&#x4F5C;&#x5212;&#x5206;&#xFF0C;&#x4E8E;&#x662F;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x56DB;&#x4E2A;&#x5173;&#x952E;&#x89D2;&#x8272;&#xFF1A;</p>
<ul>
<li><strong>&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#xFF08;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x88AB;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x5177;&#x4F53;&#x5B9E;&#x4F8B;&#xFF09;</strong>&#xFF1A; &#x7528;&#x4E8E;&#x58F0;&#x660E;&#x6700;&#x7EC8;&#x76EE;&#x6807;&#x4EA7;&#x54C1;&#x7684;&#x5171;&#x6027;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x91CC;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x5BF9;&#x5E94;&#x7684;&#x8FD9;&#x4E00;&#x7C7B;&#x4EA7;&#x54C1;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x4EA7;&#x54C1;&#x65CF;&#x201D;&#x3002;</li>
<li><strong>&#x5177;&#x4F53;&#x5DE5;&#x5382;&#xFF08;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x4EA7;&#x54C1;&#x65CF;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4EA7;&#x54C1;&#xFF09;</strong>&#xFF1A; &#x7EE7;&#x627F;&#x81EA;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x3001;&#x5B9E;&#x73B0;&#x4E86;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x91CC;&#x58F0;&#x660E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5177;&#x4F53;&#x7684;&#x4EA7;&#x54C1;&#x7684;&#x7C7B;&#x3002;</li>
<li><strong>&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#xFF08;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x88AB;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x5177;&#x4F53;&#x5B9E;&#x4F8B;&#xFF09;</strong>&#xFF1A; &#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x91CC;&#x5B9E;&#x73B0;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F1A;&#x4F9D;&#x8D56;&#x4E00;&#x4E9B;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x5BF9;&#x5E94;&#x5230;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5177;&#x4F53;&#x7684;&#x7EC6;&#x7C92;&#x5EA6;&#x4EA7;&#x54C1;&#xFF08;&#x6BD4;&#x5982;&#x501F;&#x8BB0;&#x5361;&#x3001;&#x4FE1;&#x7528;&#x5361;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7C7B;&#x7684;&#x5171;&#x6027;&#x5404;&#x81EA;&#x62BD;&#x79BB;&#xFF0C;&#x4FBF;&#x5BF9;&#x5E94;&#x5230;&#x4E86;&#x5404;&#x81EA;&#x7684;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x7C7B;&#x3002;</li>
<li><strong>&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#xFF08;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x4EA7;&#x54C1;&#x65CF;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4EA7;&#x54C1;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x66F4;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x4EA7;&#x54C1;&#xFF09;</strong>&#xFF1A; &#x6587;&#x4E2D;&#x5177;&#x4F53;&#x7684;&#x4E00;&#x5F20;&#x501F;&#x8BB0;&#x5361;&#x6216;&#x4FE1;&#x7528;&#x5361;&#x6216;&#x8005;&#x7EC4;&#x88C5;&#x7684;&#x4E3B;&#x673A;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x6761;&#x3001;&#x4E00;&#x5757;&#x786C;&#x76D8;&#x7B49;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="工厂模式.html" class="navigation navigation-prev " aria-label="Previous page: 工厂模式">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="建造者模式.html" class="navigation navigation-next " aria-label="Next page: 建造者模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"抽象工厂模式","level":"1.2.4","depth":2,"next":{"title":"建造者模式","level":"1.2.5","depth":2,"path":"doc/design-patterns/建造者模式.md","ref":"doc/design-patterns/建造者模式.md","articles":[]},"previous":{"title":"工厂模式","level":"1.2.3","depth":2,"path":"doc/design-patterns/工厂模式.md","ref":"doc/design-patterns/工厂模式.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"doc/design-patterns/抽象工厂模式.md","mtime":"2020-03-26T13:17:39.195Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-28T01:51:13.974Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

